insert into posts (user_id, head, date ) values
(
'1',
'Сегодня поговорим о логическом продолжении моей статьи про Гит. Также я советую прочесть материал о стратегиях ветвления, который я опубликовал ранее.
В статье про Гит я описал, как работать с ним в командной строке, а сегодня покажу, как сделать все это в Intellij IDEA.
В начале своего пути как разработчика я пользовался именно командной строкой и думал, что мне незачем использовать UI для этого дела. Ведь все понятно и так… Но это было ровно до того момента, пока я не начал использовать Гит в Intellij IDEA…
Хочу сказать сразу, что я буду описывать личный опыт работы. Есть несколько вариантов решения одних и тех же задач через Intellij IDEA, и если вы знаете, как сделать лучше то, что я опишу в статье — пишите в комментарии, обсудим.',
'2020-01-25'
),

(
'1',
'Создание приложений с Spring Boot
Этот урок показывает пример того, как Spring Boot помогает вам ускорить и облегчить разработку приложений.
Из учебных материалов вы увидите случаи использования Spring Boot.
Если вы хотите создать проект на его основе, то посетите Spring Initializr, заполните онформацию о проекте,
выберите опции и вы сможете загрузить файл сборки Maven, либо Gradle, либо как проект в виде zip-файла.',
'2020-03-07'
)

;